<h1 style='background-color: #FAF9F6; color: #11557C; text-align: left; font-family: 'Arial', sans-serif; padding: 20px; border-bottom: 1px solid #11557C;'>
    SQL com Jupyter Notebook  
</h1>

#### Bibliotecas Utilizadas

 - pandas
 - ipython-sql

#### Preparando o Banco de Dados

Para começar, execute o código a seguir. Ele é necessário para criar e preparar o banco de dados e o ambiente para podermos utilizar comandos **SQL** no **Jupyter Notebook**.  
Não se preocupe em entender e interpretar esta parte, o objetivo deste notebook são os comandos SQL das próximas células!

Como requisito, você deve adicionar **```%%sql```** na célula de código antes de executar um comando SQL, ok?

In [1]:
# Preparando o Banco de Dados

import pandas as pd
import sqlite3 
import os


# --- Criação dos DataFrames ---
# DataFrame de Clientes
dados_clientes = {
    'id_cliente': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'nome': ['João', 'Maria', 'Pedro', 'Ana', 'Carlos', 'Clara', 'Luiz', 'Graziela', 'Beatriz', 'Mariana'],
    'idade': [20, 25, 30, 35, 40, 51, 44, 47, 22, 18],
    'email': ['joao@email.com', 'maria@email.com', 'pedro@email.com', 'ana@email.com', 'carlos@email.com', 'clara@email.com', 'luiz@email.com', 'grazi@email.com', 'bia@email.com', 'mari@email.com'],
    'cidade': ['São Paulo', 'Rio de Janeiro', 'Porto Alegre', 'Belo Horizonte', 'Salvador', 'Recife', 'Santos', 'São Paulo', 'Salvador', 'Guarulhos'],
    'estado': ['SP', 'RJ', 'RS', 'MG', 'BA', 'PE', 'SP', 'SP', 'BA', 'SP']
}

# DataFrame de Pedidos
dados_pedidos = {
    'id_pedido': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
    'id_cliente': [1, 1, 1, 1, 2, 2, 3, 3, 3, 3, 3, 3, 4, 6, 6],
    'produto': ['celular', 'videogame', 'computador', 'celular', 'videogame', 'televisão', 'computador', 'celular', 'videogame', 'televisão', 'televisão', 'computador', 'celular', 'videogame', 'televisão'],
    'marca': ['ACME', 'XPTO', 'ICOMP', 'ACME', 'XPTO', 'ICOMP', 'ACME', 'XPTO', 'ICOMP', 'ACME','ACME','ACME','XPTO','XPTO','XPTO'],
    'quantidade': [1, 2, 1, 1, 1, 2, 3, 1, 1, 2, 3, 1, 1, 2, 1],
    'preco': [1250.00, 4250.50, 1750.99, 3750.25, 2250.00, 5250.50, 2750.00, 4750.25, 3250.00, 1400.00, 1250.00, 4250.50, 1750.99, 3750.25, 2250.00]
}


clientes_df = pd.DataFrame(dados_clientes)
pedidos_df = pd.DataFrame(dados_pedidos)

print("\n")

# criando a conexão
if os.path.exists('bancodados.db'):   
    print("Banco de Dados 'bancodados.db' OK.")
    try:
        clientes_df.to_sql('tbClientes', conexao)
        pedidos_df.to_sql('tbPedidos', conexao)
    except:
        print("Tabelas 'tbClientes' e 'tbProdutos' OK.")
    %reload_ext sql
else:
    conexao = sqlite3.connect('bancodados.db')

    # criando as  tabelas no banco de dados
    clientes_df.to_sql('tbClientes', conexao)
    pedidos_df.to_sql('tbPedidos', conexao)

    print("Banco de Dados 'bancodados.db' OK.")
    print("Tabelas 'tbClientes' e 'tbProdutos' OK.")
    
    # load the sql module to iPython
    %load_ext sql

# apontando para o banco de dados que vamos usar
%sql sqlite:///bancodados.db

Banco de Dados 'bancodados.db' OK.
Tabelas 'tbClientes' e 'tbProdutos' OK.

<a id='indice'></a>
----------------
#### Índíce

- [Consultar todos os dados de uma tabela](#secao-1)
- [Consultar os dados de uma ou mais colunas da tabela](#secao-2)
- [Filtrar a pesquisa](#secao-3)
- [Consultar as primeiras linhas](#secao-4)
- [Valores distintos](#secao-5)
- [Contagem de valores distintos](#secao-6)
- [Agrupamento](#secao-7)
- [Ordenação](#secao-8)
- [Junções](#secao-9)
- [INNER JOIN](#secao-10)
- [LEFT JOIN](#secao-11)
- [Valor Mínimo](#secao-12)
- [Valor Máximo](#secao-13)
- [Média](#secao-14)
- [Filtrar agregações](#secao-15)
- [Criar tabela](#secao-16)
- [Inserir dados em uma tabela](#secao-17)
- [Atualizar dados em uma tabela](#secao-18)
- [Apagar uma tabela](#secao-19)
- [Agora é sua vez!](#secao-20)


  
**Estrutura do Banco de Dados:**  

![image.png](https://res.cloudinary.com/ddrdmilou/image/upload/w_750/v1699096417/tabelas_vpmlxm.png)


Vamos trabalhar com duas **tabelas**: a tabela de *Clientes* (**tbClientes**) e a tabela de *Pedidos* (**tbPedidos**)

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-1'></a>Consultar todos os dados de uma tabela  
</h3>

Comando: **```SELECT```** * **```FROM```** *tabela*

A cláusula 'SELECT' é utilizada para recuperar dados de um banco de dados.  
A cláusula 'FROM' é usada para especificar a tabela da qual você deseja recuperar os dados. 


Quem são nossos clientes? Vamos executar o comando a seguir para descobrir!

[- voltar -](#indice)

In [2]:
%%sql


SELECT * FROM tbClientes

 * sqlite:///bancodados.db
Done.

[(0, 1, 'João', 20, 'joao@email.com', 'São Paulo', 'SP'),
 (1, 2, 'Maria', 25, 'maria@email.com', 'Rio de Janeiro', 'RJ'),
 (2, 3, 'Pedro', 30, 'pedro@email.com', 'Porto Alegre', 'RS'),
 (3, 4, 'Ana', 35, 'ana@email.com', 'Belo Horizonte', 'MG'),
 (4, 5, 'Carlos', 40, 'carlos@email.com', 'Salvador', 'BA'),
 (5, 6, 'Clara', 51, 'clara@email.com', 'Recife', 'PE'),
 (6, 7, 'Luiz', 44, 'luiz@email.com', 'Santos', 'SP'),
 (7, 8, 'Graziela', 47, 'grazi@email.com', 'São Paulo', 'SP'),
 (8, 9, 'Beatriz', 22, 'bia@email.com', 'Salvador', 'BA'),
 (9, 10, 'Mariana', 18, 'mari@email.com', 'Guarulhos', 'SP')]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-2'></a> Consultar os dados de uma ou mais colunas da tabela
</h3>

Comando: **```SELECT```** *coluna1, coluna2, colunaN* **```FROM```** *tabela*

Quais são os nomes dos clientes? E a idade deles?

[- voltar -](#indice)

In [3]:
%%sql 


SELECT 
    nome 
FROM 
    tbClientes

 * sqlite:///bancodados.db
Done.

[('João',),
 ('Maria',),
 ('Pedro',),
 ('Ana',),
 ('Carlos',),
 ('Clara',),
 ('Luiz',),
 ('Graziela',),
 ('Beatriz',),
 ('Mariana',)]

In [4]:
%%sql 


SELECT 
    nome, idade 
FROM 
    tbClientes

 * sqlite:///bancodados.db
Done.

[('João', 20),
 ('Maria', 25),
 ('Pedro', 30),
 ('Ana', 35),
 ('Carlos', 40),
 ('Clara', 51),
 ('Luiz', 44),
 ('Graziela', 47),
 ('Beatriz', 22),
 ('Mariana', 18)]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-3'></a> Filtrar a pesquisa
</h3>


cláusula: **```WHERE```** 

A cláusula 'WHERE' é usada em consultas SQL para filtrar os resultados de uma consulta

Exemplo: Quais clientes têm acima de 30 anos? Quais são do estado de SP?

[- voltar -](#indice)

In [5]:
%%sql 


SELECT 
    nome,
    idade
FROM 
    tbClientes 
WHERE 
    idade > 30

 * sqlite:///bancodados.db
Done.

[('Ana', 35), ('Carlos', 40), ('Clara', 51), ('Luiz', 44), ('Graziela', 47)]

In [6]:
%%sql 


SELECT 
    nome,
    idade,
    cidade,
    estado
FROM 
    tbClientes 
WHERE 
    idade > 30
    AND estado = "SP"

 * sqlite:///bancodados.db
Done.

[('Luiz', 44, 'Santos', 'SP'), ('Graziela', 47, 'São Paulo', 'SP')]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-4'></a> Consultar as primeiras linhas
</h3>

cláusula: **```LIMIT```**

A cláusula 'LIMIT' é usada em consultas SQL para restringir o número de linhas retornadas em um resultado de consulta. 

Exemplo: Verificando uma amostra dos 5 primeiros registros da tabela.

[- voltar -](#indice)

In [7]:
%%sql 


SELECT 
    nome,
    idade,
    cidade,
    estado
FROM 
    tbClientes 
LIMIT 5

 * sqlite:///bancodados.db
Done.

[('João', 20, 'São Paulo', 'SP'),
 ('Maria', 25, 'Rio de Janeiro', 'RJ'),
 ('Pedro', 30, 'Porto Alegre', 'RS'),
 ('Ana', 35, 'Belo Horizonte', 'MG'),
 ('Carlos', 40, 'Salvador', 'BA')]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-5'></a> Valores distintos
</h3>


cláusula: **```DISTINCT```** 

A cláusula 'DISTINCT' é usada em consultas SQL para retornar apenas valores distintos, ou seja, valores únicos, de uma determinada coluna ou de um conjunto de colunas.


Exemplo: De quais estados são meus clientes?


[- voltar -](#indice)

In [8]:
%%sql 


SELECT 
    DISTINCT estado 
FROM 
    tbClientes

 * sqlite:///bancodados.db
Done.

[('SP',), ('RJ',), ('RS',), ('MG',), ('BA',), ('PE',)]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-6'></a> Contagem de valores distintos
</h3>


cláusulas: **```COUNT```** e **```DISTINCT```**

A cláusula 'COUNT' é usada para contar o número de linhas que atendem a uma determinada condição em uma tabela. Quando combinada com 'DISTINCT', o COUNT conta o número de valores únicos em uma coluna ou conjunto de colunas.

Exemplo: Quantos estados distintos têm minha tabela de clientes?

[- voltar -](#indice)

In [9]:
%%sql 


SELECT 
    COUNT(DISTINCT estado) as qt_estados
FROM 
    tbClientes

 * sqlite:///bancodados.db
Done.

[(6,)]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-7'></a> Agrupamento
</h3>


cláusula: **```GROUP BY```**

A cláusula 'GROUP BY' é utilizada em consultas SQL para agrupar linhas que possuem valores iguais em uma ou mais colunas, permitindo realizar operações de agregação, como COUNT, SUM, AVG, entre outras, em cada grupo formado. Ela ajuda a criar resumos ou análises agrupadas dos dados com base em valores semelhantes em uma ou mais colunas.

Exemplo: Quantos clientes tenho em cada cidade?

[- voltar -](#indice)

In [10]:
%%sql 


SELECT 
    cidade, 
    COUNT(id_cliente) as qt_clientes
FROM 
    tbClientes
GROUP BY 
    Cidade

 * sqlite:///bancodados.db
Done.

[('Belo Horizonte', 1),
 ('Guarulhos', 1),
 ('Porto Alegre', 1),
 ('Recife', 1),
 ('Rio de Janeiro', 1),
 ('Salvador', 2),
 ('Santos', 1),
 ('São Paulo', 2)]

In [11]:
%%sql 


SELECT 
    cidade, 
    COUNT(id_cliente) as qt_clientes
FROM 
    tbClientes
WHERE 
    idade > 40
GROUP BY 
    Cidade

 * sqlite:///bancodados.db
Done.

[('Recife', 1), ('Santos', 1), ('São Paulo', 1)]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-8'></a> Ordenação
</h3>


cláusula: **```ORDER BY```**

A cláusula 'ORDER BY' é utilizada em consultas SQL para ordenar os resultados de uma consulta de acordo com os valores de uma ou mais colunas. Ela permite classificar os dados retornados em ordem ascendente 'ASC' (do menor para o maior) ou em ordem descendente 'DESC' (do maior para o menor) com base nos valores encontrados em uma ou mais colunas.

Vamos colocar as coisas em ordem?

[- voltar -](#indice)

In [12]:
%%sql 


SELECT 
    nome, 
    idade 
FROM 
    tbClientes 
WHERE 
    idade < 25
ORDER BY 
    idade

 * sqlite:///bancodados.db
Done.

[('Mariana', 18), ('João', 20), ('Beatriz', 22)]

In [13]:
%%sql 


SELECT 
    nome, 
    idade 
FROM 
    tbClientes 
WHERE 
    idade < 25
ORDER BY 
    idade DESC

 * sqlite:///bancodados.db
Done.

[('Beatriz', 22), ('João', 20), ('Mariana', 18)]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-9'></a> Junções
</h3>

Vamos juntar agora a tabela '**tbPedidos**' com a tabela '**tbClientes**'!

Consultando todos os registros da tabela de Pedidos:

[- voltar -](#indice)

In [14]:
%%sql 


SELECT 
    * 
FROM 
    tbPedidos

 * sqlite:///bancodados.db
Done.

[(0, 1, 1, 'celular', 'ACME', 1, 1250.0),
 (1, 2, 1, 'videogame', 'XPTO', 2, 4250.5),
 (2, 3, 1, 'computador', 'ICOMP', 1, 1750.99),
 (3, 4, 1, 'celular', 'ACME', 1, 3750.25),
 (4, 5, 2, 'videogame', 'XPTO', 1, 2250.0),
 (5, 6, 2, 'televisão', 'ICOMP', 2, 5250.5),
 (6, 7, 3, 'computador', 'ACME', 3, 2750.0),
 (7, 8, 3, 'celular', 'XPTO', 1, 4750.25),
 (8, 9, 3, 'videogame', 'ICOMP', 1, 3250.0),
 (9, 10, 3, 'televisão', 'ACME', 2, 1400.0),
 (10, 11, 3, 'televisão', 'ACME', 3, 1250.0),
 (11, 12, 3, 'computador', 'ACME', 1, 4250.5),
 (12, 13, 4, 'celular', 'XPTO', 1, 1750.99),
 (13, 14, 6, 'videogame', 'XPTO', 2, 3750.25),
 (14, 15, 6, 'televisão', 'XPTO', 1, 2250.0)]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-10'></a> INNER JOIN
</h3>

cláusula: **```INNER JOIN```** ou **```JOIN```**

A cláusula 'INNER JOIN', ou apenas 'JOIN', é utilizada em consultas SQL para combinar linhas de duas ou mais tabelas com base em uma condição especificada, resultando em um conjunto de resultados que contém apenas as linhas que possuem correspondências entre as tabelas envolvidas na junção.

Exemplo: Quais clientes fizeram pedidos?

[- voltar -](#indice)

In [15]:
%%sql 

SELECT 
    tbClientes.id_cliente, 
    tbClientes.nome, 
    tbPedidos.id_pedido, 
    tbPedidos.produto, 
    tbPedidos.quantidade, 
    tbPedidos.preco 
FROM tbClientes 
    INNER JOIN tbPedidos ON (tbClientes.id_cliente = tbPedidos.id_cliente)

 * sqlite:///bancodados.db
Done.

[(1, 'João', 1, 'celular', 1, 1250.0),
 (1, 'João', 2, 'videogame', 2, 4250.5),
 (1, 'João', 3, 'computador', 1, 1750.99),
 (1, 'João', 4, 'celular', 1, 3750.25),
 (2, 'Maria', 5, 'videogame', 1, 2250.0),
 (2, 'Maria', 6, 'televisão', 2, 5250.5),
 (3, 'Pedro', 7, 'computador', 3, 2750.0),
 (3, 'Pedro', 8, 'celular', 1, 4750.25),
 (3, 'Pedro', 9, 'videogame', 1, 3250.0),
 (3, 'Pedro', 10, 'televisão', 2, 1400.0),
 (3, 'Pedro', 11, 'televisão', 3, 1250.0),
 (3, 'Pedro', 12, 'computador', 1, 4250.5),
 (4, 'Ana', 13, 'celular', 1, 1750.99),
 (6, 'Clara', 14, 'videogame', 2, 3750.25),
 (6, 'Clara', 15, 'televisão', 1, 2250.0)]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-11'></a> LEFT JOIN
</h3>

cláusula: **```LEFT JOIN```** 

A cláusula 'LEFT JOIN' é usada em consultas SQL para combinar as linhas de duas tabelas, retornando todos os registros da tabela à esquerda (tabela base) e apenas os registros correspondentes da tabela à direita, baseado em uma condição de junção.

Ao contrário do INNER JOIN, o LEFT JOIN garante que todas as linhas da tabela à esquerda (primeira tabela) sejam incluídas no resultado, independentemente de existirem ou não correspondências na tabela à direita (segunda tabela). Se não houver correspondência na tabela à direita, os valores correspondentes serão nulos no resultado da consulta.


Exemplo: Mostre todos os clientes, mesmo os que não fizeram pedidos.


[- voltar -](#indice)

In [16]:
%%sql 


SELECT 
    tbClientes.id_cliente, 
    tbClientes.nome, 
    tbPedidos.id_pedido, 
    tbPedidos.produto, 
    tbPedidos.quantidade, 
    tbPedidos.preco 
FROM tbClientes 
    LEFT JOIN tbPedidos ON (tbClientes.id_cliente = tbPedidos.id_cliente)

 * sqlite:///bancodados.db
Done.

[(1, 'João', 1, 'celular', 1, 1250.0),
 (1, 'João', 2, 'videogame', 2, 4250.5),
 (1, 'João', 3, 'computador', 1, 1750.99),
 (1, 'João', 4, 'celular', 1, 3750.25),
 (2, 'Maria', 5, 'videogame', 1, 2250.0),
 (2, 'Maria', 6, 'televisão', 2, 5250.5),
 (3, 'Pedro', 7, 'computador', 3, 2750.0),
 (3, 'Pedro', 8, 'celular', 1, 4750.25),
 (3, 'Pedro', 9, 'videogame', 1, 3250.0),
 (3, 'Pedro', 10, 'televisão', 2, 1400.0),
 (3, 'Pedro', 11, 'televisão', 3, 1250.0),
 (3, 'Pedro', 12, 'computador', 1, 4250.5),
 (4, 'Ana', 13, 'celular', 1, 1750.99),
 (5, 'Carlos', None, None, None, None),
 (6, 'Clara', 14, 'videogame', 2, 3750.25),
 (6, 'Clara', 15, 'televisão', 1, 2250.0),
 (7, 'Luiz', None, None, None, None),
 (8, 'Graziela', None, None, None, None),
 (9, 'Beatriz', None, None, None, None),
 (10, 'Mariana', None, None, None, None)]

In [17]:
%%sql 


SELECT 
    tbClientes.id_cliente, 
    tbClientes.nome, 
    tbPedidos.id_pedido, 
    tbPedidos.produto, 
    tbPedidos.quantidade, 
    tbPedidos.preco 
FROM tbClientes 
    LEFT JOIN tbPedidos ON (tbClientes.id_cliente = tbPedidos.id_cliente)
WHERE
    tbPedidos.preco > 3000
ORDER BY
    tbPedidos.preco DESC

 * sqlite:///bancodados.db
Done.

[(2, 'Maria', 6, 'televisão', 2, 5250.5),
 (3, 'Pedro', 8, 'celular', 1, 4750.25),
 (1, 'João', 2, 'videogame', 2, 4250.5),
 (3, 'Pedro', 12, 'computador', 1, 4250.5),
 (1, 'João', 4, 'celular', 1, 3750.25),
 (6, 'Clara', 14, 'videogame', 2, 3750.25),
 (3, 'Pedro', 9, 'videogame', 1, 3250.0)]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-12'></a> Valor mínimo
</h3>

cláusula: **```MIN```**

A cláusula 'MIN' retorna o valor mínimo de uma coluna.

Exemplo: Consulta para encontrar o menor preço de cada produto.

[- voltar -](#indice)

In [18]:
%%sql


SELECT 
    produto, 
    MIN(preco) AS menor_preco
FROM 
    tbPedidos
GROUP BY 
    produto

 * sqlite:///bancodados.db
Done.

[('celular', 1250.0),
 ('computador', 1750.99),
 ('televisão', 1250.0),
 ('videogame', 2250.0)]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-13'></a> Valor máximo
</h3>

cláusula: **```MAX```**

A cláusula 'MAX' retorna o valor máximo de uma coluna.

Exemplo: Consulta para encontrar o maior preço de cada produto.

[- voltar -](#indice)

In [19]:
%%sql


SELECT 
    produto, 
    MAX(preco) AS maior_preco
FROM 
    tbPedidos
GROUP BY 
    produto

 * sqlite:///bancodados.db
Done.

[('celular', 4750.25),
 ('computador', 4250.5),
 ('televisão', 5250.5),
 ('videogame', 4250.5)]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-14'></a> Média
</h3>

cláusula: **```AVG```**

A cláusula 'AVG' retorna o cálculo da média de uma coluna.

Exemplo: Consulta para calcular a média de preços por produto.

[- voltar -](#indice)

In [20]:
%%sql


SELECT 
    produto, 
    AVG(preco) AS media_preco
FROM 
    tbPedidos
GROUP BY 
    produto

 * sqlite:///bancodados.db
Done.

[('celular', 2875.3725),
 ('computador', 2917.1633333333334),
 ('televisão', 2537.625),
 ('videogame', 3375.1875)]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-15'></a> Filtrar agregações
</h3>

cláusula: **```HAVING```**

A cláusula 'HAVING' é utilizada em consultas SQL, normalmente em conjunto com a cláusula GROUP BY, para impor condições às agregações resultantes. 

Exemplo: Listar clientes com mais de 2 pedidos.

[- voltar -](#indice)

In [21]:
%%sql


SELECT 
    tbClientes.id_cliente, 
    tbClientes.nome, 
    COUNT(*) as total_pedidos
FROM tbClientes 
    LEFT JOIN tbPedidos ON (tbClientes.id_cliente = tbPedidos.id_cliente)
WHERE
    tbClientes.estado = "SP"
GROUP BY 
    tbClientes.id_cliente
HAVING 
    COUNT(*) > 2

 * sqlite:///bancodados.db
Done.

[(1, 'João', 4)]

In [22]:
%%sql


SELECT 
    produto, 
    AVG(preco) as media_preco
FROM 
    tbPedidos
GROUP BY 
    produto
HAVING 
    AVG(preco) > 3000

 * sqlite:///bancodados.db
Done.

[('videogame', 3375.1875)]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-16'></a> Criar tabela
</h3>

comando: **```CREATE TABLE```** *tabela*

O comando 'CREATE TABLE' é uma instrução do SQL usada para criar uma nova tabela em um banco de dados.

Exemplo: criar a tabela 'tbFornecedores' no nosso banco de dados.

[- voltar -](#indice)

In [23]:
%%sql


CREATE TABLE tbFornecedores (
    id_fornecedor INT PRIMARY KEY,
    nome_fornecedor VARCHAR(50),
    cidade VARCHAR(50),
    estado VARCHAR(2)
)

 * sqlite:///bancodados.db
Done.

[]

In [24]:
%%sql

SELECT * FROM tbFornecedores

 * sqlite:///bancodados.db
Done.

[]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-17'></a> Inserir dados em uma tabela
</h3>

comando: **```INSERT INTO```** *tabela*

O comando 'INSERT INTO' é uma instrução SQL utilizada para adicionar novos registros ou linhas a uma tabela existente em um banco de dados. Ele permite inserir novos valores nas colunas de uma tabela, especificando os dados que você deseja adicionar.

[- voltar -](#indice)

In [25]:
%%sql



INSERT INTO tbFornecedores (id_fornecedor, nome_fornecedor, cidade, estado)
VALUES (1, 'ACME', 'São Paulo', 'SP')

 * sqlite:///bancodados.db
1 rows affected.

[]

In [26]:
%%sql 

SELECT * FROM tbFornecedores

 * sqlite:///bancodados.db
Done.

[(1, 'ACME', 'São Paulo', 'SP')]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-18'></a> Atualizar dados em uma tabela
</h3>

comando: **```UPDATE```** *tabela*

A cláusula 'UPDATE' é usada em SQL para modificar os valores de uma ou mais colunas em registros existentes em uma tabela. Esta cláusula permite alterar os dados já presentes em uma tabela, atualizando informações específicas em um ou mais registros que correspondam a determinadas condições.

Exemplo: atualizar o nome de um fornecedor da tabela tbFornecedores

[- voltar -](#indice)

In [27]:
%%sql

UPDATE tbFornecedores
SET nome_fornecedor = 'XPTO'
WHERE id_fornecedor = 1

 * sqlite:///bancodados.db
1 rows affected.

[]

In [28]:
%%sql 

SELECT * FROM tbFornecedores

 * sqlite:///bancodados.db
Done.

[(1, 'XPTO', 'São Paulo', 'SP')]

<h3 style="background-color: #FAF9F6; color: #EB5E28; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-19'></a> Apagar uma tabela
</h3>

comando: **```DROP TABLE```** *tabela*

O comando 'DROP TABLE' é uma instrução do SQL utilizada para excluir uma tabela existente em um banco de dados. Essa instrução remove completamente a estrutura da tabela, juntamente com todos os dados armazenados nela.

Exemplo: apagar a tabela tbFornecedores do banco de dados.

[- voltar -](#indice)

In [29]:
%%sql


DROP TABLE tbFornecedores

 * sqlite:///bancodados.db
Done.

[]

<h3 style="background-color: #FAF9F6; color: #0197F6; text-align: left; font-family: 'Arial', sans-serif; padding-top: 10px; padding-bottom: 10px; border-bottom: 1px solid #11557C;">
    <a id='secao-20'></a> Agora é sua vez!
</h3>

**Realize as suas consultas no banco de dados na célula abaixo!**

[- voltar -](#indice)

In [30]:
%%sql

 * sqlite:///bancodados.db

--------------
#### Encerrar conexão e apagar banco de dados

Execute a célula abaixo para encerrar a conexão e apagar o banco de dados

In [32]:
try:
    # Fecha a conexão com o banco de dados e apaga o banco de dados
    if os.path.exists('bancodados.db'):     
        conexao.close()  
        os.remove('bancodados.db')
        print("Banco de dados 'bancodados.db' foi encerrado com sucesso.")
    else:
        print("O banco de dados 'bancodados.db' não existe.")
except:
    print("Acesso Negado: Não foi possível realizar a exclusão do bando de dados.")

Acesso Negado: Não foi possível realizar a exclusão do bando de dados.